# -*- coding: utf-8 -*-
# L:\SER\Охрименко\03. RastrWin3\01.Dynamic_KAES\DRM_ZimaMax2020.rst

# file_name_rst = 'C:\\Users\\Ohrimenko_AG\\Documents\\RastrWin3\\test-rastr\\RUSTab\\test9.rst'
# file_name_scn = 'C:\\Users\\Ohrimenko_AG\\Documents\\RastrWin3\\test-rastr\\RUSTab\\test9.scn'

dir_file_rst = 'L:\\SER\\Охрименко\\03. RastrWin3\\02.Dynamic_KosrGRES\\DRM_ZimaMax2020.rst'
dir_file_scn = 'L:\\SER\\Охрименко\\03. RastrWin3\\02.Dynamic_KosrGRES'

dir_fileSaveExcel = r'L:\SER\Охрименко\03. RastrWin3\02.Dynamic_KosrGRES\Результаты'

# ************ Ремонтные схемы *************
dict_repairs = {1: ['0', '0', '0', 'Норм_схема'],
                2: ['20902113', '51601023', '0', 'ВЛ_500кВ_КосГРЭС_Луч'],
                3: ['20902153', '51601022', '0', 'ВЛ_500кВ_КосГРЭС_Нижегородская'],
                4: ['51601020', '51402386', '0', 'ВЛ_500кВ_КосГРЭС_Владимирская'],
                5: ['51601017', '51000435', '0', 'ВЛ_500кВ_КосГРЭС_ЗАГАЭС'],
                6: ['51602058', '51601016', '0', 'ВЛ_500кВ_КосГРЭС_КострАЭС'],
                7: ['51601100', '51601021', '0', 'АТ_2_500_220'],
                8: ['51601101', '51601015', '0', 'АТ_4_500_220'],
                9: ['51302001', '51601130', '0', 'ВЛ_220кВ_КосГРЭС_Вичуга_1'],
                10: ['51301001', '51601132', '0', 'ВЛ_220кВ_КосГРЭС_Иваново_1'],
                11: ['51500374', '51601137', '0', 'ВЛ_220кВ_КосГРЭС_Ярославская'],
                12: ['51601135', '51603025', '0', 'ВЛ_220кВ_КосГРЭС_Мотордеталь_1'],
                13: ['51601134', '51603001', '0', 'ВЛ_220кВ_КосГРЭС_Кострома_2']}


# dict_repairs = {1: ['0', '0', '0', 'Норм_схема'],
#                 2: ['52702980', '52301711', '0', 'ВЛ_750_КАЭС_Металлург'],
#                 3: ['52301709', '80320042', '0', 'ВЛ_750_КАЭС_Североукр']}

# dict_repairs = {1: ['52301717', '80320045', '0', 'ВЛ_330_КАЭС_Шостка']}

# dict_repairs = {1: ['0', '0', '0', 'Норм_схема'],
#                 2: ['1347', '1', '0', 'Onda110_Stat2_1'],
#                 3: ['1', '1347', '1', 'Onda110_Stat2_2'],
#                 4: ['1347', '1349', '0', 'Onda110_Bol2_1'],
#                 5: ['1347', '1349', '1', 'Onda110_Bol2_2'],
#                 6: ['1347', '1349', '2', 'Onda110_Bol2_3'],
#                 7: ['347', '1347', '0', 'АТ_Onda_Onda110']}


# ************ Вывод результатов *************

dict_output_results = {1: ['51601026', '51601008', '0', 'ТГ-8 (РУ 500кВ)'],
                       2: ['51601033', '51601001', '0', 'ТГ-1 (РУ 220кВ)']}

# *************** Лист названий файлов СЦЕНАРИЙ *****************
# list_scn = ['1.scn', '2.scn']

# list_scn = ['1.scn', '2.scn', '3.scn', '4.scn', '5.scn', '6.scn', '7.scn', '9.scn', '10.scn', '11.scn',
#             '12.scn']

list_scn = ['1.scn', '2.scn', '3.scn', '4.scn', '5.scn', '6.scn', '7.scn', '8.scn', '10.scn', '12.scn', '13.scn',
            '15.scn']


list_scn_name = ['1.ВЛ 500 кВ Костромская ГРЭС - Луч',
                 '2.ВЛ 500 кВ Костромская ГРЭС - Нижегородская',
                 '3.ВЛ 500 кВ Костромская ГРЭС - Владимирская',
                 '4.ВЛ 500 кВ Костромская ГРЭС - Загорская ГАЭС',
                 '5.ВЛ 500 кВ Костромская ГРЭС - Костромская АЭС',
                 '6.АТ-2 500/220',
                 '7.АТ-4 500/220',
                 '8.ВЛ 220 кВ Костромская ГРЭС - Вичуга цепь 1',
                 '10.ВЛ 220 кВ Костромская ГРЭС - Иваново цепь 1',
                 '12.ВЛ 220 кВ Костромская ГРЭС - Ярославская',
                 '13.ВЛ 220 кВ Костромская ГРЭС - Мотордеталь цепь 1',
                 '15.ВЛ 220 кВ Костромская ГРЭС - Кострома-2']

# list_scn_name = ['1.ВЛ 750кВ КурскаяАЭС - Металлургическая',
#                  '2.ВЛ 750 кВ Курская АЭС - Североукраинская']


# *************** Лист названий ВЛ на которых АО по сценариям *****************

# list_scn_name_AO = ['ВЛ_750_КАЭС_Металлург',
#                     'ВЛ_750_КАЭС_Североукр']

list_scn_name_AO = ['ВЛ 500кВ Костромская ГРЭС-Луч',
                    'ВЛ 500кВ Костромская ГРЭС-Нижегородская',
                    'ВЛ 500кВ Костромская ГРЭС-Владимирская',
                    'ВЛ 500кВ Костромская ГРЭС-Загорская ГАЭС',
                    'ВЛ 500кВ Костромская ГРЭС-Костромская АЭС',
                    'АТ-2 500/220',
                    'АТ-4 500/220',
                    'ВЛ 220кВ Костромская ГРЭС-Вичуга 1',
                    'ВЛ 220кВ Костромская ГРЭС-Иваново 1',
                    'ВЛ 220кВ Костромская ГРЭС-Ярославская',
                    'ВЛ 220кВ Костромская ГРЭС-Мотордеталь 1',
                    'ВЛ 220кВ Костромская ГРЭС-Кострома-2']

list_manual = ['Схема:',
               'Аварийное отключение объекта =>',
               'Ном. напряжение в точке КЗ:',
               'Откл. номер начала (N_нач =>ip):',
               'Откл. Номер конца (N_кон =>iq):',
               'Откл. Номер параллельной (N_п =>np):',
               'Откл. Название (name):',
               'Сценарий:',
               'АО:',
               '']

dict_cell_chart = {1: ['G11', 'Q11', 'AA11', 'AK11', 'B2', 'X2'],
                   2: ['G26', 'Q26', 'AA26', 'AK26', 'B52', 'X52'],
                   3: ['G41', 'Q41', 'AA41', 'AK41', 'B102', 'X102'],
                   4: ['G56', 'Q56', 'AA56', 'AK56', 'B152', 'X152'],
                   5: ['G71', 'Q71', 'AA71', 'AK71', 'B202', 'X202'],
                   6: ['G86', 'Q86', 'AA86', 'AK86', 'B252', 'X252'],
                   7: ['G101', 'Q101', 'AA101', 'AK101', 'B302', 'X302'],
                   8: ['G116', 'Q116', 'AA116', 'AK116', 'B352', 'X352'],
                   9: ['G131', 'Q131', 'AA131', 'AK131', 'B402', 'X402'],
                   10: ['G146', 'Q146', 'AA146', 'AK146', 'B452', 'X452'],
                   11: ['G161', 'Q161', 'AA161', 'AK161', 'B502', 'X502'],
                   12: ['G176', 'Q176', 'AA176', 'AK176', 'B552', 'X552'],
                   13: ['G191', 'Q191', 'AA191', 'AK191', 'B602', 'X602'],
                   14: ['G206', 'Q206', 'AA206', 'AK206', 'B652', 'X652'],
                   15: ['G221', 'Q221', 'AA221', 'AK221', 'B702', 'X702'],
                   16: ['G236', 'Q236', 'AA236', 'AK236', 'B752', 'X752'],
                   17: ['G251', 'Q251', 'AA251', 'AK251', 'B802', 'X802'],
                   18: ['G266', 'Q266', 'AA266', 'AK266', 'B852', 'X852'],
                   19: ['G281', 'Q281', 'AA281', 'AK281', 'B902', 'X902'],
                   20: ['G296', 'Q296', 'AA296', 'AK296', 'B952', 'X952'],
                   21: ['G311', 'Q311', 'AA311', 'AK311', 'B1002', 'X1002'],
                   22: ['G326', 'Q326', 'AA326', 'AK326', 'B1052', 'X1052'],
                   23: ['G341', 'Q341', 'AA341', 'AK341', 'B1102', 'X1102'],
                   24: ['G356', 'Q356', 'AA356', 'AK356', 'B1152', 'X1152'],
                   25: ['G371', 'Q371', 'AA371', 'AK371', 'B1202', 'X1202']}

if __name__ == '__main__':
    from icecream import ic
    from openpyxl import load_workbook

    wb = load_workbook(filename='C:\\Users\\Ohrimenko_AG\\Desktop\\21\\44.xlsx')
    sh = wb.sheetnames
    ic(sh)
    ic(len(sh))
    ic(len(list_scn))
    t = len(dict_repairs)
    ic(t)

    # for i in dict_scn:
    #     ic(i)
    #     ic(dict_scn[i])
    #     ic(dict_scn[i][0])
    #     ic(dict_scn[i][1])
    #     ic(dict_scn[i][2])
    #     ic(dict_scn[i][3])
    #     ic(dict_scn[i][4])

    # for i in dict_repairs:
    #     ic(f'{dict_repairs[i][0]} | {dict_repairs[i][1]} | {dict_repairs[i][2]} | {dict_repairs[i][3]}')
    #     for j in list_scn:
    #         ic(j)

    ic(list_scn_name_AO[0])
    ic(list_scn_name_AO[1])
