# -*- coding: utf-8 -*-
# L:\SER\Охрименко\03. RastrWin\01.Dynamic_KAES\DRM_ZimaMax2020.rst
#
# file_name_rst = 'C:\\Users\\Ohrimenko_AG\\Documents\\RastrWin\\test-rastr\\RUSTab\\test9.rst'
# file_name_scn = 'C:\\Users\\Ohrimenko_AG\\Documents\\RastrWin\\test-rastr\\RUSTab\\test9.scn'

dir_file_rst = 'L:\\SER\\Охрименко\\03. RastrWin\\01.Dynamic_KAES\\DRM_ZimaMax2020.rst'
dir_file_scn = 'L:\\SER\\Охрименко\\03. RastrWin\\01.Dynamic_KAES'

dir_fileSaveExcel = 'L:\\SER\\Охрименко\\03. RastrWin\\01.Dynamic_KAES\\Результат'

# ************ Ремонтные схемы *************
dict_repairs = {1: ['0', '0', '0', 'Норм_схема'],
                2: ['52702980', '52301711', '0', 'ВЛ_750_КАЭС_Металлург'],
                3: ['52301709', '80320042', '0', 'ВЛ_750_КАЭС_Североукр'],
                4: ['52301707', '52301704', '0', 'ВЛ_750_2_3'],
                5: ['51990124', '52301702', '0', 'ВЛ_750_КАЭС_Новобрянская'],
                6: ['52301712', '52301745', '0', 'АТ_1_750_330'],
                7: ['52301675', '52301746', '0', 'АТ_2_750_330'],
                8: ['52307743', '52301726', '0', 'ВЛ_330_КАЭС_Южная_1'],
                9: ['52301731', '52303771', '0', 'ВЛ_330_КАЭС_Железногорская'],
                10: ['52301725', '52307828', '0', 'ВЛ_330_КАЭС_Курская'],
                11: ['52301720', '80320047', '0', 'ВЛ_330_КАЭС_СумыСеверная'],
                12: ['52301717', '80320045', '0', 'ВЛ_330_КАЭС_Шостка']}

# ************ Вывод результатов *************
dict_output_results = {1: ['52301741', '52301736', '0', 'ТГ-5 (РУ 750кВ)'],
                       2: ['52301730', '52301732', '0', 'ТГ-1 (РУ 330кВ)']}

# *************** Лист названий файлов СЦЕНАРИЙ *****************

list_scn = ['1.scn', '2.scn', '3.scn', '4.scn', '5.scn', '6.scn', '7.scn', '9.scn', '10.scn', '11.scn',
            '12.scn']

list_scn_name = ['1.ВЛ 750кВ КурскаяАЭС - Металлургическая',
                 '2.ВЛ 750 кВ Курская АЭС - Североукраинская',
                 '3.ВЛ 750 кВ КАЭС - 2-3',
                 '4.ВЛ 750 кВ Курская АЭС - Новобрянская',
                 '5.АТ-1 750/330',
                 '6.АТ-2 750/330',
                 '7.ВЛ 330 кВ Курская АЭС - Южная 1 цепь',
                 '8.ВЛ 330 кВ Курская АЭС - Железногорская',
                 '9.ВЛ 330 кВ Курская АЭС - Курская',
                 '10.ВЛ 330 кВ Курская АЭС - Сумы Северная',
                 '11.ВЛ 330 кВ Курская АЭС - Шостка']


# *************** Лист названий ВЛ на которых АО по сценариям *****************

list_scn_name_AO = ['ВЛ_750_КАЭС_Металлург',
                    'ВЛ_750_КАЭС_Североукр',
                    'ВЛ_750_2_3',
                    'ВЛ_750_КАЭС_Новобрянская',
                    'АТ_1_750_330',
                    'АТ_2_750_330',
                    'ВЛ_330_КАЭС_Южная_1',
                    'ВЛ_330_КАЭС_Железногорская',
                    'ВЛ_330_КАЭС_Курская',
                    'ВЛ_330_КАЭС_СумыСеверная',
                    'ВЛ_330_КАЭС_Шостка']

list_manual = ['Схема:',
               'Аварийное отключение объекта =>',
               'Ном. напряжение в точке КЗ:',
               'Откл. номер начала (N_нач =>ip):',
               'Откл. Номер конца (N_кон =>iq):',
               'Откл. Номер параллельной (N_п =>np):',
               'Откл. Название (name):',
               'Сценарий:',
               'АО:',
               '']

dict_cell_chart = {1: ['G11', 'Q11', 'AA11', 'AK11', 'B2', 'X2'],
                   2: ['G26', 'Q26', 'AA26', 'AK26', 'B52', 'X52'],
                   3: ['G41', 'Q41', 'AA41', 'AK41', 'B102', 'X102'],
                   4: ['G56', 'Q56', 'AA56', 'AK56', 'B152', 'X152'],
                   5: ['G71', 'Q71', 'AA71', 'AK71', 'B202', 'X202'],
                   6: ['G86', 'Q86', 'AA86', 'AK86', 'B252', 'X252'],
                   7: ['G101', 'Q101', 'AA101', 'AK101', 'B302', 'X302'],
                   8: ['G116', 'Q116', 'AA116', 'AK116', 'B352', 'X352'],
                   9: ['G131', 'Q131', 'AA131', 'AK131', 'B402', 'X402'],
                   10: ['G146', 'Q146', 'AA146', 'AK146', 'B452', 'X452'],
                   11: ['G161', 'Q161', 'AA161', 'AK161', 'B502', 'X502'],
                   12: ['G176', 'Q176', 'AA176', 'AK176', 'B552', 'X552'],
                   13: ['G191', 'Q191', 'AA191', 'AK191', 'B602', 'X602'],
                   14: ['G206', 'Q206', 'AA206', 'AK206', 'B652', 'X652'],
                   15: ['G221', 'Q221', 'AA221', 'AK221', 'B702', 'X702'],
                   16: ['G236', 'Q236', 'AA236', 'AK236', 'B752', 'X752'],
                   17: ['G251', 'Q251', 'AA251', 'AK251', 'B802', 'X802'],
                   18: ['G266', 'Q266', 'AA266', 'AK266', 'B852', 'X852'],
                   19: ['G281', 'Q281', 'AA281', 'AK281', 'B902', 'X902'],
                   20: ['G296', 'Q296', 'AA296', 'AK296', 'B952', 'X952'],
                   21: ['G311', 'Q311', 'AA311', 'AK311', 'B1002', 'X1002'],
                   22: ['G326', 'Q326', 'AA326', 'AK326', 'B1052', 'X1052'],
                   23: ['G341', 'Q341', 'AA341', 'AK341', 'B1102', 'X1102'],
                   24: ['G356', 'Q356', 'AA356', 'AK356', 'B1152', 'X1152'],
                   25: ['G371', 'Q371', 'AA371', 'AK371', 'B1202', 'X1202']}

if __name__ == '__main__':
    from icecream import ic
    from openpyxl import load_workbook

    wb = load_workbook(filename='C:\\Users\\Ohrimenko_AG\\Desktop\\21\\44.xlsx')
    sh = wb.sheetnames
    ic(sh)
    ic(len(sh))
    ic(len(list_scn))
    t = len(dict_repairs)
    ic(t)

    # for i in dict_scn:
    #     ic(i)
    #     ic(dict_scn[i])
    #     ic(dict_scn[i][0])
    #     ic(dict_scn[i][1])
    #     ic(dict_scn[i][2])
    #     ic(dict_scn[i][3])
    #     ic(dict_scn[i][4])

    # for i in dict_repairs:
    #     ic(f'{dict_repairs[i][0]} | {dict_repairs[i][1]} | {dict_repairs[i][2]} | {dict_repairs[i][3]}')
    #     for j in list_scn:
    #         ic(j)

    ic(list_scn_name_AO[0])
    ic(list_scn_name_AO[1])
