# -*- coding: utf-8 -*-
# Модуль переменных таблицы "Описание альтернативных единиц измерения" RastrWin3

table = 'AltUnit'

Active: str = 'Active'  # Активизация альтернативной ЕИ (A)
Unit: str = 'Unit'  # Основная Единица Измерения (ЕИ)
Alt: str = 'Alt'  # Альтернативная Единица Измерения (Альт ЕИ)
Formula: str = 'Formula'  # Формула для преобразования (Формула)
Prec: str = 'Prec'  # Точность отображение Альт ЕИ (Точность)
Tabl: str = 'Tabl'  # Ограничитель по таблице (Табл)

alt_unit_table = 'AltUnit'
alt_unit_attributes_list = ['Active', 'Unit', 'Alt', 'Formula', 'Prec', 'Tabl', ]
alt_unit_attributes = {
    'Active': 'Активизация альтернативной ЕИ (A)',
    'Unit': 'Основная Единица Измерения (ЕИ)',
    'Alt': 'Альтернативная Единица Измерения (Альт ЕИ)',
    'Formula': 'Формула для преобразования (Формула)',
    'Prec': 'Точность отображение Альт ЕИ (Точность)',
    'Tabl': 'Ограничитель по таблице (Табл)',
}
